#include <stdio.h>
 
int main(){
    int x, y;   // ประกาศตัวแปรจำนวนเต็ม 
    
    printf("Enter x: "); // รับค่าตัวแปร X
    scanf("%d", &x);    
    printf("Enter y: ");  // รับค่าตัวแปร y
    scanf("%d", &y);
    
    if (x > y) {    // ตรวจสอบเงื่อนไขว่า x > y ให้ทำคำสั่งใน {}
        printf("x มากกว่า y\n");  // ถ้าเงื่อนไขด้านบนเป็นจริง จะแสดงค่าข้อความว่า x มากกว่า y
    } else if (x < y) {    // ถ้าx > y ไม่จริง จะตรวจสอบเงื่อนไขใหม่ว่า x < y หรือไม่ 
        printf("x น้อยกว่า y\n");  // ถ้า x < y เป็นจริง จะแสดงข้อความว่า x น้อยกว่า y
    } else {     // ถ้าไม่เข้าเงื่อนไขทั้ง x > y และ x < y แสดงว่า x == y 
        printf("x เท่ากับ y\n"); // ถ้า x == y จะแสดงข้อความว่า x เท่ากับ y
    }
    
    return 0;
}